[
  {
    "id": 1,
    "title": "Warren Buffett Plans to Step Down as Berkshire Hathaway CEO by End of 2025",
    "content": "Mr. Buffett said at the annual shareholders’ meeting that he wanted to turn over the reins to Greg Abel at the end of the year. Earlier, he criticized Trump’s trade policies."
  },
  {
    "id": 2,
    "title": "Car Prices Expected to Rise as Tariffs on Parts Kick In",
    "content": "Tariffs on imported parts will have a broad impact because all vehicles use components made abroad."
  },
  {
    "id": 3,
    "title": "As China Looks for Way Out of U.S. Trade Deadlock, Fentanyl Could Be Key",
    "content": "Chinese officials have long used their willingness to cooperate to stem the flow of fentanyl to the United States as leverage in talks over broader disputes."
  },
  {
    "id": 4,
    "title": "Harvard’s President Alan Garber Talks About His Legal Fight With Trump",
    "content": "Alan Garber became a hero to liberals after Harvard resisted the federal government. At the same time, he is trying to remake campus culture in ways the Trump administration might appreciate."
  },
  {
    "id": 5,
    "title": "No Country for Old Politicians? Some California Democrats Want an Age Cap.",
    "content": "As the Democratic Party tries to win back support, some members say forcing older politicians to retire is one solution."
  },
  {
    "id": 6,
    "title": "Trump Administration Sues Colorado and Denver Over Immigration Policies",
    "content": "The lawsuit, which names the governor and mayor as defendants, is the latest move by the White House to try to get local governments to cooperate more with its immigration agenda."
  },
  {
    "id": 7,
    "title": "Druse in Syrian Town Rocked by Violence Agree to Disarm Militias",
    "content": "After this week’s bloodshed, Druse leaders in Ashrafieh Sahnaya agreed to integrate militia fighters into government forces. But some residents remain wary."
  },
  {
    "id": 8,
    "title": "How Misinformation and Partisan ‘New Media’ Changed a California Town",
    "content": "Residents of Oakdale, Calif., have abandoned traditional media outlets for a mishmash of online sources. These days, they’re often not sure what information to trust."
  },
  {
    "id": 9,
    "title": "In Montana, a Rare Sight: Republicans and Democrats Voting Together",
    "content": "Derided by critics as the “Nasty Nine” and censured by the state party, a group of Republican state senators said they were simply advancing common-sense legislation and supporting the governor’s agenda."
  },
  {
    "id": 10,
    "title": "The Best Hats at the 2025 Kentucky Derby",
    "content": "From traditional hats to fascinators and headdresses, the best looks at the 151st running of America’s most fashionable sporting event."
  },
  {
    "id": 11,
    "title": "Honey, Sweetie, Dearie: The Perils of Elderspeak",
    "content": "A new training program teaches aides to stop baby talk and address older people as adults."
  },
  {
    "id": 12,
    "title": "One of the Weather World’s Biggest Buzzwords Expands Its Reach",
    "content": "To many, atmospheric rivers are a West Coast phenomenon. But they’re also responsible for the devastating flooding that hit the Central United States in early April."
  },
  {
    "id": 13,
    "title": "April’s Storms Were Relentless. But the Rainwater Is Finally Going Away.",
    "content": "The Mississippi River crested in New Orleans this week, capping an anxious period for the engineers and residents who live alongside it."
  },
  {
    "id": 14,
    "title": "‘The Handmaid’s Tale’ Wants to End With a Message of Hope",
    "content": "In interviews, Elisabeth Moss and other stars and creators of the groundbreaking drama discuss its impending conclusion and ongoing connection to American politics."
  },
  {
    "id": 15,
    "title": "What Kennedy Gets Right, And Wrong, About Antidepressants",
    "content": "Prozac is nearly 40 years old. Why are there still unanswered questions?"
  },
  {
    "id": 16,
    "title": "For Just One Day, a Mother and Child Reunite in Prison",
    "content": "In “Weekend Visits,” an incarcerated woman spends a day with her child at an extended visitation house in Virginia."
  },
  {
    "id": 17,
    "title": "How Has Marriage Equality Changed Your Life?",
    "content": "As we near the 10-year anniversary of Obergefell v. Hodges, the Supreme Court case that legalized same-sex marriage nationwide, we’d like to hear how this decision affected you or those you love."
  },
  {
    "id": 18,
    "title": "Weed Manager of the Year: One Man’s Quest to Save the Sonoran Desert",
    "content": "As official research positions are lost to budget cuts, the work of citizen scientists to preserve federal forests is becoming more valuable."
  },
  {
    "id": 19,
    "title": "Chicago Museum Director Under Investigation After Airplane Incident",
    "content": "James Rondeau, the director of the Art Institute of Chicago, took a voluntary leave after a report that he stripped off his clothes during a flight to Germany."
  },
  {
    "id": 20,
    "title": "Hikers Stumble Upon a Pile of Gold Coins, Igniting a Historical Hunt",
    "content": "The discovery of coins and jewelry in the Czech Republic worth up to $680,000 raises a tantalizing mystery for historians and amateur sleuths: Who buried the treasure?"
  },
  {
    "id": 21,
    "title": "Why Designated Beneficiaries Are Key to Your Estate Planning",
    "content": "Although a will is crucial to making sure your assets go where you want them when you die, you are likely to need something else, too: designated beneficiaries."
  }
]